# Exploring Data with Python

## Exploring Arrays with NumPy

In [1]:
# data in a python list structure
# lists are good for data manipulation but not optimal for numeric analysis
data = [50,50,47,97,49,3,53,42,26,74,82,62,37,15,70,27,36,35,48,52,63,64]
print(data)

[50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]

In [2]:
import numpy as np

grades = np.array(data)
print(grades)

[50 50 47 97 49  3 53 42 26 74 82 62 37 15 70 27 36 35 48 52 63 64]

Let's explore differences in arrays and lists.

In [3]:
print(type(data), 'x 2:', data * 2)
print('----------------')
print(type(grades), 'x 2:', grades * 2)

<class 'list'> x 2: [50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64, 50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]
----------------
<class 'numpy.ndarray'> x 2: [100 100  94 194  98   6 106  84  52 148 164 124  74  30 140  54  72  70
  96 104 126 128]

For a list, multiplying by 2 creates a new list with the same elements repeated twice.
For an array, an element-wise calculation is performed, where the array behaves like a vector. The resulting array is the same size and has each element multiplied by 2.

Arrays are designed to support mathematic operations on numeric data. They are also more efficient than lists for storing and manipulating numeric data.

The array can also have dimensions (its type is an ndarray- n dimensional array).

In [10]:
grades.shape

(22,)

The shape of the array shows it is a one dimensional array containing 22 elements. The elements can be accessed by zero based ordinal indexing.

In [12]:
grades[0]

50

You can apply aggregate functions across the elements of the array.

In [13]:
grades.mean()

49.18181818181818

In [14]:
# Define an array of study hours
study_hours = [10.0,11.5,9.0,16.0,9.25,1.0,11.5,9.0,8.5,14.5,15.5,
               13.75,9.0,8.0,15.5,8.0,9.0,6.0,10.0,12.0,12.5,12.0]

# Create a 2D array (an array of arrays)
student_data = np.array([study_hours, grades])

# display the array
student_data

array([[10.  , 11.5 ,  9.  , 16.  ,  9.25,  1.  , 11.5 ,  9.  ,  8.5 ,
        14.5 , 15.5 , 13.75,  9.  ,  8.  , 15.5 ,  8.  ,  9.  ,  6.  ,
        10.  , 12.  , 12.5 , 12.  ],
       [50.  , 50.  , 47.  , 97.  , 49.  ,  3.  , 53.  , 42.  , 26.  ,
        74.  , 82.  , 62.  , 37.  , 15.  , 70.  , 27.  , 36.  , 35.  ,
        48.  , 52.  , 63.  , 64.  ]])

Now we have a 2 dimensional array showing the students grades as well as their typical study hours per week.

In [17]:
student_data.shape
# shows us the shape is 2 elements, each of which is a 22 element array

(2, 22)

In [16]:
# you can index like its a nested list
# first index is the row, second index is the column
# first element of the first element
student_data[0][0]

10.0

In [19]:
# get the means of each subarray
avg_study = student_data[0].mean()
avg_grade = student_data[1].mean()

print(f'Average study hours: {round(avg_study, 2)}\nAverage grade: {round(avg_grade, 2)}')

Average study hours: 10.52
Average grade: 49.18

## Exploring Tabular Data with Pandas

Numpy is great for working wiith arrays of numeric values, but when dealing with 2 dimensional tables of data, Pandas provides the Dataframe- a more convenient way to work with tabular data.

In [21]:
import pandas as pd

df_students = pd.DataFrame({'Name': ['Dan', 'Joann', 'Pedro', 'Rosie', 'Ethan', 'Vicky', 'Frederic', 'Jimmie', 
                                     'Rhonda', 'Giovanni', 'Francesca', 'Rajab', 'Naiyana', 'Kian', 'Jenny',
                                     'Jakeem','Helena','Ismat','Anila','Skye','Daniel','Aisha'],
                            'StudyHours':student_data[0],
                            'Grade':student_data[1]})

# by default, we get integer indices for each row

df_students

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
12    Naiyana        9.00   37.0
13       Kian        8.00   15.0
14      Jenny       15.50   70.0
15     Jakeem        8.00   27.0
16     Helena        9.00   36.0
17      Ismat        6.00   35.0
18      Anila       10.00   48.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

### Finding and Filtering with Dataframes

In [22]:
# get data at a certain index value with the loc method
df_students.loc[5]

Name          Vicky
StudyHours      1.0
Grade           3.0
Name: 5, dtype: object

In [23]:
# can also use loc for a range of index values
df_students.loc[0:5]

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0
5  Vicky        1.00    3.0

In [24]:
# use iloc when trying to find rows based on their ordinal position regardless of index
df_students.iloc[0:5]

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0

`loc` returned 6 values because it returned all rows with an index label in the list of values 0-5, which is 0, 1, 2, 3, 4, and 5 (6 values). `iloc` returned rows in positions in the range 0-5. The upper bound of the range is exclusive, so it returned rows in positions 0, 1, 2, 3, and 4 (5 values).

`iloc` identifies data by position, which can extend beyond rows to columns. You can therefore use it to grab just specific columns for a certain row (or vice versa)

In [27]:
df_students.iloc[0:3,[1,2]]
# return columns 1 and 2 for rows 0, 1, 2

   StudyHours  Grade
0        10.0   50.0
1        11.5   50.0
2         9.0   47.0

`loc` is used based on index value as opposed to position, so you can specify columns but it has to be by column name

In [31]:
df_students.loc[0:3, ['Name', 'Grade']]

    Name  Grade
0    Dan   50.0
1  Joann   50.0
2  Pedro   47.0
3  Rosie   97.0

In [32]:
# loc can be used to find index rows based on filtering expressions
df_students.loc[df_students['Name']=='Aisha']

     Name  StudyHours  Grade
21  Aisha        12.0   64.0

In [33]:
# can also be done without the loc method
df_students[df_students['Name']=='Aisha']

     Name  StudyHours  Grade
21  Aisha        12.0   64.0

In [34]:
# can also use the query method
df_students.query('Name == "Aisha"')

     Name  StudyHours  Grade
21  Aisha        12.0   64.0

As can be seen, there are often multiple ways to do the exact same thing in pandas.

Another example of this is how column names are referred to. You can use the column name as a property of the dataframe, or you can use the column name as a key in a dictionary.

In [36]:
# instead of df_students[df_students['Name']=='Aisha'], you can do
df_students[df_students.Name =='Aisha']

     Name  StudyHours  Grade
21  Aisha        12.0   64.0

In [39]:
# you can also load data from a file into a dataframe easily
df_students = pd.read_csv('grades.csv',delimiter=',',header='infer')
df_students.head()

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0

In [41]:
# handling missing values- this tells us but is inefficient
df_students.isnull()

     Name  StudyHours  Grade
0   False       False  False
1   False       False  False
2   False       False  False
3   False       False  False
4   False       False  False
5   False       False  False
6   False       False  False
7   False       False  False
8   False       False  False
9   False       False  False
10  False       False  False
11  False       False  False
12  False       False  False
13  False       False  False
14  False       False  False
15  False       False  False
16  False       False  False
17  False       False  False
18  False       False  False
19  False       False  False
20  False       False  False
21  False       False  False
22  False       False   True
23  False        True   True

In [43]:
#this gives us a summary of null values by column
df_students.isnull().sum()

Name          0
StudyHours    1
Grade         2
dtype: int64

In [47]:
# we can view null values in context by filtering to include only rows where any columns are null
# note- columns = axis 1, rows = axis 0
df_students[df_students.isnull().any(axis=1)]

    Name  StudyHours  Grade
22  Bill    8.000000    NaN
23   Ted   10.413043    NaN

In [45]:
# we can impute values here if we want to fill the nulls
df_students.StudyHours = df_students.StudyHours.fillna(df_students.StudyHours.mean())
df_students

         Name  StudyHours  Grade
0         Dan   10.000000   50.0
1       Joann   11.500000   50.0
2       Pedro    9.000000   47.0
3       Rosie   16.000000   97.0
4       Ethan    9.250000   49.0
5       Vicky    1.000000    3.0
6    Frederic   11.500000   53.0
7      Jimmie    9.000000   42.0
8      Rhonda    8.500000   26.0
9    Giovanni   14.500000   74.0
10  Francesca   15.500000   82.0
11      Rajab   13.750000   62.0
12    Naiyana    9.000000   37.0
13       Kian    8.000000   15.0
14      Jenny   15.500000   70.0
15     Jakeem    8.000000   27.0
16     Helena    9.000000   36.0
17      Ismat    6.000000   35.0
18      Anila   10.000000   48.0
19       Skye   12.000000   52.0
20     Daniel   12.500000   63.0
21      Aisha   12.000000   64.0
22       Bill    8.000000    NaN
23        Ted   10.413043    NaN

In [48]:
# we could also just drop the rows with nulls
df_students = df_students.dropna(axis=0, how='any')
df_students

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
12    Naiyana        9.00   37.0
13       Kian        8.00   15.0
14      Jenny       15.50   70.0
15     Jakeem        8.00   27.0
16     Helena        9.00   36.0
17      Ismat        6.00   35.0
18      Anila       10.00   48.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

Now we can explore the data in the dataframe

In [50]:
# get the avg study hours using column name as an index
mean_study = df_students['StudyHours'].mean()

# get the mean grade using the column name as a property
mean_grade = df_students.Grade.mean()

print(f'Average study hours: {round(mean_study, 2)}\nAverage grade: {round(mean_grade, 2)}')

Average study hours: 10.52
Average grade: 49.18

In [51]:
# now filter with just students who studied for more than the average study time
df_students = df_students[df_students['StudyHours'] > mean_study]

In [52]:
df_students[df_students.StudyHours > mean_study].Grade.mean()

66.7

In [53]:
# assuming the passing grade is 60, we can add a new column indicating pass/fail
# create a series of booleans indicating pass or fail based on the grades
passes = pd.Series(df_students['Grade'] >= 60)

# concatenate it as a new column of the dataframe
df_students = pd.concat([df_students, passes.rename("Pass")], axis=1)

df_students

         Name  StudyHours  Grade   Pass
1       Joann       11.50   50.0  False
3       Rosie       16.00   97.0   True
6    Frederic       11.50   53.0  False
9    Giovanni       14.50   74.0   True
10  Francesca       15.50   82.0   True
11      Rajab       13.75   62.0   True
14      Jenny       15.50   70.0   True
19       Skye       12.00   52.0  False
20     Daniel       12.50   63.0   True
21      Aisha       12.00   64.0   True

Dataframes can performmany of the same kinds of data analytics as in a relational database. For example, you can group data by a column and then perform an aggregate function on the grouped data.

In [54]:
# groupy and count to see how many students passed and failed
print(df_students.groupby(df_students.Pass).Name.count())

Pass
False    3
True     7
Name: Name, dtype: int64

In [55]:
# aggregate multiple fields in a group using any available aggregation function

# find average study time and grade for failing and passing students
print(df_students.groupby(df_students.Pass)['StudyHours', 'Grade'].mean())

       StudyHours      Grade
Pass
False   11.666667  51.666667
True    14.250000  73.142857

C:\Users\dhsav\AppData\Local\Temp\ipykernel_22244\3315996223.py:4: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  print(df_students.groupby(df_students.Pass)['StudyHours', 'Grade'].mean())

In [56]:
df_students = df_students.sort_values('Grade', ascending=False)

df_students

         Name  StudyHours  Grade   Pass
3       Rosie       16.00   97.0   True
10  Francesca       15.50   82.0   True
9    Giovanni       14.50   74.0   True
14      Jenny       15.50   70.0   True
21      Aisha       12.00   64.0   True
20     Daniel       12.50   63.0   True
11      Rajab       13.75   62.0   True
6    Frederic       11.50   53.0  False
19       Skye       12.00   52.0  False
1       Joann       11.50   50.0  False